org/programming/fsharp.org
#+STARTUP: hideall
#+OPTIONS: H:3 num:nil tags:nil ^:nil todo:nil tasks:done toc:nil timestamps:t
#+EXCLUDE_TAGS: TOC_3
#+LANGUAGE: bt-br
#+DATE: 2017-08-20
#+TITLE: Aprendendo F#
#+DESCRIPTION: Um breve relato de aventura entre Mono e .NET Core
#+AUTHOR: Manoel Vilela
#+CATEGORIES: programming
#+TAGS:  programming
#+LAYOUT: post
#+COMMENTS: true
#+HTML_HEAD: <link rel=\"stylesheet\" href=\"./assets/css/style.css\" type=\"text/css\"/>

#+BEGIN_EXPORT html
<link rel="stylesheet"
      href="/assets/css/style.css"
      type="text/css"/>
#+END_EXPORT


* Table of Contents :TOC_3:
- [[#descrição][Descrição]]
- [[#setup][Setup]]
  - [[#pacotes-instalados-no-manjaro][Pacotes instalados no Manjaro]]
  - [[#mudar-entre-múltiplas-versões-do-sdk-de-net-core][Mudar entre múltiplas versões do SDK de .NET Core]]
  - [[#issues-com-net-core][Issues com .NET Core]]
    - [[#bugs-com-múltiplos-sdks-instalados][Bugs com múltiplos SDKs instalados]]
    - [[#inviabilidade-de-usar-sdk-104-em-alguns-casos][Inviabilidade de usar SDK 1.0.4 em alguns casos]]
    - [[#fable-template-só-funciona-com-a-versão-104-conflito-com-sdk-20][Fable Template só funciona com a versão 1.0.4: conflito com sdk 2.0]]
    - [[#monodevelop-e-fable][MonoDevelop e Fable]]
    - [[#emacs-e-f][Emacs e F#]]
- [[#syntax][Syntax]]
  - [[#funções-tuplas-e-pattern-matching][Funções, tuplas e pattern matching]]
  - [[#funções-recursivas][Funções recursivas]]
  - [[#sequências-listas-e-arrays][Sequências, Listas e Arrays]]
- [[#ecosystem][Ecosystem]]
  - [[#web-development][Web Development]]
  - [[#api-net-core][API .NET Core]]
- [[#tooling][Tooling]]
  - [[#forge][Forge]]
    - [[#forge-add-reference-não-funciona-com-o-nuget][Forge add reference não funciona com o Nuget]]
    - [[#adicionar-um-asset-não-compilável-para-fsproj][Adicionar um asset não compilável para fsproj]]
  - [[#dotnet-self-contained-apps][Dotnet Self-Contained Apps]]

* Descrição

Este arquivo contém notas pessoais sobre aprendizado do ecossistema de F#.

* Setup
** Pacotes instalados no Manjaro
Atualmente tenho instalados o mono junto com trocentas coisas. Aliás, embora
isso não tenha nada a ver, é somente com o monodevelop que estou conseguindo
definitivamente usar F# [1]. Não dei jeito ainda no meu emacs. Vou verificar depois
se consigo usar.

Mas para instalar o .NET Core precisei dos seguintes pacotes que estão no AUR:

- dotnet-sdk-2.0
- dotnet-host
- dotnet-runtime-1.1
- dotnet-sdk-1.1

Já instalei tanta coisa que nem sei mais o que é realmente necessário. Mas, bem,
na verdade o setup mais estável que consegui foi instalando os seguintes pacotes
do AUR:

- dotnet-host (cli dotnet, cross-sdk manager)
- dotnet-runtime-1.1
- dotnet-sdk-1.1 (actually 1.0.4)


De resto estou conseguindo me virar.

[1]: Na verdade estou conseguindo usar o Emacs e VS code também. Só tenho
problemas com o MonoDevelop na hora de usar .NET Core quando faz referências
a pacotes do paket. O Emacs estou tendo problemas apenas com os templates usados
pelo .NET Core SDK 1.0.4. VS Code está supostamente funcionando tudo, tirando a parte
que ele me dá kernel panic.
** Mudar entre múltiplas versões do SDK de .NET Core

É possível definir a versão por projeto do .NET Core, criando um arquivo
~global.json~ na raíz do projeto:

#+BEGIN_SRC json
{
  "projects": [ "src", "test" ],
  "sdk": {
    "version": "1.0.4"
  }
}
#+END_SRC

Inclusive é a que estou usando atualmente pra mexer com Fable. Pois simplesmente
a versão 2.0 preview está com muitos problemas e não é recomendada pelo pessoal
do fable. Na verdade, eles até falam que é possível fazer desenvolvimento do projeto,
embora recomendem usar o SDK 1.0.4, no entanto simplesmente os templates não funcionam.
Queria apenas um template que funcionasse...

EDIT <2017-08-16 Wed 06:55>:
Isso na verdade gera um outro problema, que é do cache ficar sendo repopulado toda
vez que é chamado. Não sei se corrigiu recentemente, mas estava tendo sérios problemas com isso!
Se eu precisar novamente fazer isso e vê que não funciona setar o ~global.json~, venho comentar isso aqui.

** Issues com .NET Core
*** Bugs com múltiplos SDKs instalados

Usar ao mesmo tempo sdk 2.0 e 1.0.4 dá merda. Embora haja a opção pra
a definir a versão por projeto, simplesmente toda vez que chamo o
comando ~dotnet new~ é populado o diretório cache de pacotes do nuget
e outras coisas SEMPRE. E isso é beeeem demorado. Leva quase 2 minutos.
Executar um comando recorrente que leva 2 minutos é simplesmente
inviável.

*** Inviabilidade de usar SDK 1.0.4 em alguns casos

Outro ponto infeliz é que simplesmente os templates para F# PRATICAMENTE
de todos que testei estão cagados na versão SDK 1.0.4. Simplesmente os arquivos
.fsproj são legacy, não funcionam na hora de dar build nem com os comandos
do .NET core. O xbuild também não funciona pela linha de comando nem pelo
emacs. Por outro lado, como última alternativa, o comando `msbuild` funciona.
Mas não o do .NET Core (dotnet msbuild), somente o do mono [1].

EDIT <2017-08-06 Sun 06:10>: parece que esse problema específico já foi
reportado, e para minha alegria está com a tag wont-fix, QUE MARAVILHA.
Isto foi corrigido no SDK 2.0, mas o fable não deixa eu usar o sdk 2.0...
De qualquer maneira, aqui está: [[https://github.com/dotnet/netcorecli-fsc/issues/91][dotnet/netcorecli-fsc/issues/91]].

Além do mais eu também criei minha própria issue no dotnet/cli.
Aqui está: [[https://github.com/dotnet/cli/issues/7378][dotnet/cli/issues/7378]]

Eles falaram que Fsharp.Net.SDK foi deprecated e é também a causa desse problema.

[1]: NOTA às <2017-08-16 Wed 06:52>:
esse comando não vem por padrão no mono! só pude usar na minha máquina
porque tenho o MonoDevelop instalado e por dependência ele instala o pacote do AUR
~msbuild-15-bin~

