_posts/2017-08-20-fsharp.html
---
date: 2017-08-20 00:00
author: Manoel Vilela
title: Aprendendo F#
excerpt: Um breve relato de aventura entre Mono e .NET Core
categories: 
- programming
tags: 
layout: post
comments: true
html_head: <link rel=\"stylesheet\" href=\"./assets/css/style.css\" type=\"text/css\"/>
---
<link rel="stylesheet"
      href="/assets/css/style.css"
      type="text/css"/>


<div id="outline-container-orgd316ce9" class="outline-2">
<h2 id="orgd316ce9">Descrição</h2>
<div class="outline-text-2" id="text-orgd316ce9">
<p>
Este arquivo contém notas pessoais sobre aprendizado do ecossistema de F#.
</p>
</div>
</div>

<div id="outline-container-org7392442" class="outline-2">
<h2 id="org7392442">Setup</h2>
<div class="outline-text-2" id="text-org7392442">
</div>
<div id="outline-container-orgfdf9d06" class="outline-3">
<h3 id="orgfdf9d06">Pacotes instalados no Manjaro</h3>
<div class="outline-text-3" id="text-orgfdf9d06">
<p>
Atualmente tenho instalados o mono junto com trocentas coisas. Aliás, embora
isso não tenha nada a ver, é somente com o monodevelop que estou conseguindo
definitivamente usar F# [1]. Não dei jeito ainda no meu emacs. Vou verificar depois
se consigo usar.
</p>

<p>
Mas para instalar o .NET Core precisei dos seguintes pacotes que estão no AUR:
</p>

<ul class="org-ul">
<li>dotnet-sdk-2.0</li>
<li>dotnet-host</li>
<li>dotnet-runtime-1.1</li>
<li>dotnet-sdk-1.1</li>
</ul>

<p>
Já instalei tanta coisa que nem sei mais o que é realmente necessário. Mas, bem,
na verdade o setup mais estável que consegui foi instalando os seguintes pacotes
do AUR:
</p>

<ul class="org-ul">
<li>dotnet-host (cli dotnet, cross-sdk manager)</li>
<li>dotnet-runtime-1.1</li>
<li>dotnet-sdk-1.1 (actually 1.0.4)</li>
</ul>


<p>
De resto estou conseguindo me virar.
</p>

<p>
[1]: Na verdade estou conseguindo usar o Emacs e VS code também. Só tenho
problemas com o MonoDevelop na hora de usar .NET Core quando faz referências
a pacotes do paket. O Emacs estou tendo problemas apenas com os templates usados
pelo .NET Core SDK 1.0.4. VS Code está supostamente funcionando tudo, tirando a parte
que ele me dá kernel panic.
</p>
</div>
</div>
<div id="outline-container-org2e18907" class="outline-3">
<h3 id="org2e18907">Mudar entre múltiplas versões do SDK de .NET Core</h3>
<div class="outline-text-3" id="text-org2e18907">
<p>
É possível definir a versão por projeto do .NET Core, criando um arquivo
<code>global.json</code> na raíz do projeto:
</p>

<div class="org-src-container">
<pre class="src src-json">{
  <span style="color: #51afef;">"projects"</span>: [ <span style="color: #7bc275;">"src"</span>, <span style="color: #7bc275;">"test"</span> ],
  <span style="color: #51afef;">"sdk"</span>: {
    <span style="color: #51afef;">"version"</span>: <span style="color: #7bc275;">"1.0.4"</span>
  }
}
</pre>
</div>

<p>
Inclusive é a que estou usando atualmente pra mexer com Fable. Pois simplesmente
a versão 2.0 preview está com muitos problemas e não é recomendada pelo pessoal
do fable. Na verdade, eles até falam que é possível fazer desenvolvimento do projeto,
embora recomendem usar o SDK 1.0.4, no entanto simplesmente os templates não funcionam.
Queria apenas um template que funcionasse&#x2026;
</p>

<p>
EDIT <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-08-16 Wed 06:55&gt;</span></span>:
Isso na verdade gera um outro problema, que é do cache ficar sendo repopulado toda
vez que é chamado. Não sei se corrigiu recentemente, mas estava tendo sérios problemas com isso!
Se eu precisar novamente fazer isso e vê que não funciona setar o <code>global.json</code>, venho comentar isso aqui.
</p>
</div>
</div>

<div id="outline-container-org13ccde3" class="outline-3">
<h3 id="org13ccde3">Issues com .NET Core</h3>
<div class="outline-text-3" id="text-org13ccde3">
</div>
<div id="outline-container-orgddf51b1" class="outline-4">
<h4 id="orgddf51b1">Bugs com múltiplos SDKs instalados</h4>
<div class="outline-text-4" id="text-orgddf51b1">
<p>
Usar ao mesmo tempo sdk 2.0 e 1.0.4 dá merda. Embora haja a opção pra
a definir a versão por projeto, simplesmente toda vez que chamo o
comando <code>dotnet new</code> é populado o diretório cache de pacotes do nuget
e outras coisas SEMPRE. E isso é beeeem demorado. Leva quase 2 minutos.
Executar um comando recorrente que leva 2 minutos é simplesmente
inviável.
</p>
</div>
</div>

<div id="outline-container-orgd0e8028" class="outline-4">
<h4 id="orgd0e8028">Inviabilidade de usar SDK 1.0.4 em alguns casos</h4>
<div class="outline-text-4" id="text-orgd0e8028">
<p>
Outro ponto infeliz é que simplesmente os templates para F# PRATICAMENTE
de todos que testei estão cagados na versão SDK 1.0.4. Simplesmente os arquivos
.fsproj são legacy, não funcionam na hora de dar build nem com os comandos
do .NET core. O xbuild também não funciona pela linha de comando nem pelo
emacs. Por outro lado, como última alternativa, o comando `msbuild` funciona.
Mas não o do .NET Core (dotnet msbuild), somente o do mono [1].
</p>

<p>
EDIT <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-08-06 Sun 06:10&gt;</span></span>: parece que esse problema específico já foi
reportado, e para minha alegria está com a tag wont-fix, QUE MARAVILHA.
Isto foi corrigido no SDK 2.0, mas o fable não deixa eu usar o sdk 2.0&#x2026;
De qualquer maneira, aqui está: <a href="https://github.com/dotnet/netcorecli-fsc/issues/91">dotnet/netcorecli-fsc/issues/91</a>.
</p>

<p>
Além do mais eu também criei minha própria issue no dotnet/cli.
Aqui está: <a href="https://github.com/dotnet/cli/issues/7378">dotnet/cli/issues/7378</a>
</p>

<p>
Eles falaram que Fsharp.Net.SDK foi deprecated e é também a causa desse problema.
</p>

<p>
[1]: NOTA às <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-08-16 Wed 06:52&gt;</span></span>:
esse comando não vem por padrão no mono! só pude usar na minha máquina
porque tenho o MonoDevelop instalado e por dependência ele instala o pacote do AUR
<code>msbuild-15-bin</code>
</p>
</div>
</div>
