org/programming/fsharp.org
*** Fable Template só funciona com a versão 1.0.4: conflito com sdk 2.0

Pra minha felicidade o fable template só tá funcionando com justamente a versão
do SDK 1.0.4, que embora seja a estável, simplesmente tá com os templates bem cagados
de F#.

Aparentemente eles mudaram recentemente a estrutura do projeto e talvez isso
tenha tido algum efeito colateral. Esta [[https://github.com/fable-compiler/Fable/issues/1042][issue]] descreve o que estou comentando.

EDIT <2017-08-06 Sun 07:09>: fazendo uma pergunta diretamente pra issue anterior,
recebi uma resposta que removendo a referencencia de Fsharp.Net.SDK dos arquivos
de .fsproj e references resolve esse problema. Estou ainda re-instalando os arquivos
para saber se isso irá mesmo corrigir. Isso está relacionado com
Inviabilidade de usar 1.0.4 em alguns casos.

EDIT2 <2017-08-06 Sun 09:17>: infelizmente a dica do carinha não funcionou e
ainda não consigo rodar o projeto com o SDK 2.0 preview 2. :(
Sinceramente estou pensando em dropar plenamente o SDK 2.0 e fazer uns
alias pros comandos que não funcionarem apontando para o certo. Como
`alias dotnet build` => msbuild do mono kkk
Mas isso não vai dar muito certo...

EDIT3 <2017-08-16 Wed 06:44>: finalmente foi lançado na <2017-08-14 Mon>
.NET Core 2.0 e ainda tive problemas relatado com esse /heading/. Na verdade
o problema é mais profundo e está relacionado a shared frameworks. Quando tenho
shared framework de SDK 1.0.4 e 2.0.0, com runtimes 1.1.2 e 2.0.0, Fable
aponta para a versão 1.0.4 DO RUNTIME que não existe. Embora instalando o runtime
1.0.4 também não funcione e a razão está descrita [[https://github.com/dotnet/cli/issues/6390][dotnet/cli/issues/6390]].
No entanto, um workaround possível é fazer um link simbólico do runtime 1.1.2 para
o 1.0.4 (e claro removendo esse runtime). Em geral apenas fazendo isso corrige:

#+BEGIN_SRC shell-script
cd /opt/dotnet/shared/Microsoft.NETCore.App
sudo ln -s 1.1.2 1.0.4
#+END_SRC

*** MonoDevelop e Fable

Uma alternativa pra criar projetos de console seria usar o MonoDevelop + Mono.
Mas, o MonoDevelop também NÃO ESTÁ FUNCIONANDO com o Fable porque simplesmente
não consegue reconhecer as dependências setadas pelo paket.

Configurei o paket pra rodar no MonoDevelop como um addin, mas também não está
funcionando. Simplesmente ele congela ao tentar fazer ~fetch~ das dependências.
Além disso, a entrada `clitool dotnet-fable` não é reconhecida pelo parser.
Sendo que isto está definido em paket.dependencies e é crucial para fazer
build do projeto.

Se faço ~dotnet restore~ pela linha de comando, mesmo funcionando pela linha de
comando o build do projeto com ~dotnet fable yarn-start~, SIMPLESMENTE o
MonoDevelop não reconhece todas as referências, explicitamente as que estão
setadas pelo paket.references. Desse modo além de não dar pra fazer build no
MonoDevelop, não tenho também autocomplete.

*** Emacs e F#

O autocomplete no emacs simplesmente só funciona quando quer. Não entendo
mais nada. Mas com o Fable nunca funcionou. Quando funciona é somente com
os projetos gerados pelo MonoDevelop (não pelos templates do .NET Core e
dotnet new). EDIT <2017-08-06 Sun 05:29>: por alguma razão ele começou a funcionar! D:
* Syntax
** Funções, tuplas e pattern matching

A maioria dos métodos de F# que fazem wrapping na API da .NET
não são funções com múltiplos argumentos, mas sim tuplas. Isso
pode ser confuso no começo, mas é assim que funciona no ecossistema
de F#. O tipo ~int * int~ denota uma tupla de inteiros (int, int).
Enquanto na notação de tipos ~int -> int~ é uma função curry que recebe
uma parâmetro int e retorna int.


#+BEGIN_SRC fsharp
open System.Net

// usando tuplas como argumento (url, file) e definindo uma função curry
// do tipo: string -> string -> unit
let download (url:string) (file:string) = new WebClient().DownloadFile(url, file)

download "www.google.com" "google.html" // faz download de um arquivo

#+END_SRC

Curried functions são muito úteis por causa da possibilidade de fazer
partial application. Onde você passa apenas alguns dos primeiros parâmetros
e então uma nova função é definida. Um exemplo simples é dado a seguir:

#+BEGIN_SRC fsharp
open System

[<EntryPoint>]
let main argv =
  let print = printfn "%d" // canonical print
  [1..10] |> List.map print |> ignore

#+END_SRC

** Funções recursivas

Uma função recursiva recebe a keyword ~rec~ antes da definição.

#+BEGIN_SRC fsharp
let rec fat n =
    match n with
    | 1 | 0 -> 1
    | _ -> n * fat (n - 1)
#+END_SRC

A precisão de entrada e saída, por padrão é Int32.

** Sequências, Listas e Arrays

Em F# há três tipos de coleções usadas:

- Seq
- List
- Array

List e Array possuem a diferença em que Arrays possuem tamanho
fixo, mas acesso constante. Listas possuem tamanhos arbitrários, mas por outro lado
o acesso é O(n).

Sequências são definidas como lazy lists, onde os elementos são avaliados
de forma preguiçosa. Um bom exemplo é um algoritmo para cálculo de números
primos de forma assíncrona:

#+BEGIN_SRC fsharp
/// A simple prime number detector
let isPrime (n:int) =
   let bound = int (sqrt (float n))
   seq {2 .. bound} |> Seq.forall (fun x -> n % x <> 0)

// We are using async workflows
let primeAsync n =
    async { return (n, isPrime n) }

/// Return primes between m and n using multiple threads
let primes m n =
    seq {m .. n}
        |> Seq.map primeAsync
        |> Async.Parallel
        |> Async.RunSynchronously
        |> Array.filter snd
        |> Array.map fst

// Run a test
primes 1000000 1002000
    |> Array.iter (printfn "%d")
#+END_SRC

* Ecosystem
