_posts/2017-08-20-fsharp.html

<div id="outline-container-org2218a87" class="outline-4">
<h4 id="org2218a87">Fable Template só funciona com a versão 1.0.4: conflito com sdk 2.0</h4>
<div class="outline-text-4" id="text-org2218a87">
<p>
Pra minha felicidade o fable template só tá funcionando com justamente a versão
do SDK 1.0.4, que embora seja a estável, simplesmente tá com os templates bem cagados
de F#.
</p>

<p>
Aparentemente eles mudaram recentemente a estrutura do projeto e talvez isso
tenha tido algum efeito colateral. Esta <a href="https://github.com/fable-compiler/Fable/issues/1042">issue</a> descreve o que estou comentando.
</p>

<p>
EDIT <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-08-06 Sun 07:09&gt;</span></span>: fazendo uma pergunta diretamente pra issue anterior,
recebi uma resposta que removendo a referencencia de Fsharp.Net.SDK dos arquivos
de .fsproj e references resolve esse problema. Estou ainda re-instalando os arquivos
para saber se isso irá mesmo corrigir. Isso está relacionado com
Inviabilidade de usar 1.0.4 em alguns casos.
</p>

<p>
EDIT2 <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-08-06 Sun 09:17&gt;</span></span>: infelizmente a dica do carinha não funcionou e
ainda não consigo rodar o projeto com o SDK 2.0 preview 2. :(
Sinceramente estou pensando em dropar plenamente o SDK 2.0 e fazer uns
alias pros comandos que não funcionarem apontando para o certo. Como
`alias dotnet build` =&gt; msbuild do mono kkk
Mas isso não vai dar muito certo&#x2026;
</p>

<p>
EDIT3 <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-08-16 Wed 06:44&gt;</span></span>: finalmente foi lançado na <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-08-14 Mon&gt;</span></span>
.NET Core 2.0 e ainda tive problemas relatado com esse <i>heading</i>. Na verdade
o problema é mais profundo e está relacionado a shared frameworks. Quando tenho
shared framework de SDK 1.0.4 e 2.0.0, com runtimes 1.1.2 e 2.0.0, Fable
aponta para a versão 1.0.4 DO RUNTIME que não existe. Embora instalando o runtime
1.0.4 também não funcione e a razão está descrita <a href="https://github.com/dotnet/cli/issues/6390">dotnet/cli/issues/6390</a>.
No entanto, um workaround possível é fazer um link simbólico do runtime 1.1.2 para
o 1.0.4 (e claro removendo esse runtime). Em geral apenas fazendo isso corrige:
</p>

<div class="org-src-container">
<pre class="src src-shell-script"><span style="color: #C57BDB;">cd</span> /opt/dotnet/shared/Microsoft.NETCore.App
sudo ln -s 1.1.2 1.0.4
</pre>
</div>
</div>
</div>

<div id="outline-container-orge68a915" class="outline-4">
<h4 id="orge68a915">MonoDevelop e Fable</h4>
<div class="outline-text-4" id="text-orge68a915">
<p>
Uma alternativa pra criar projetos de console seria usar o MonoDevelop + Mono.
Mas, o MonoDevelop também NÃO ESTÁ FUNCIONANDO com o Fable porque simplesmente
não consegue reconhecer as dependências setadas pelo paket.
</p>

<p>
Configurei o paket pra rodar no MonoDevelop como um addin, mas também não está
funcionando. Simplesmente ele congela ao tentar fazer <code>fetch</code> das dependências.
Além disso, a entrada `clitool dotnet-fable` não é reconhecida pelo parser.
Sendo que isto está definido em paket.dependencies e é crucial para fazer
build do projeto.
</p>

<p>
Se faço <code>dotnet restore</code> pela linha de comando, mesmo funcionando pela linha de
comando o build do projeto com <code>dotnet fable yarn-start</code>, SIMPLESMENTE o
MonoDevelop não reconhece todas as referências, explicitamente as que estão
setadas pelo paket.references. Desse modo além de não dar pra fazer build no
MonoDevelop, não tenho também autocomplete.
</p>
</div>
</div>

<div id="outline-container-org364269f" class="outline-4">
<h4 id="org364269f">Emacs e F#</h4>
<div class="outline-text-4" id="text-org364269f">
<p>
O autocomplete no emacs simplesmente só funciona quando quer. Não entendo
mais nada. Mas com o Fable nunca funcionou. Quando funciona é somente com
os projetos gerados pelo MonoDevelop (não pelos templates do .NET Core e
dotnet new). EDIT <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-08-06 Sun 05:29&gt;</span></span>: por alguma razão ele começou a funcionar! D:
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org9cd7ff4" class="outline-2">
<h2 id="org9cd7ff4">Syntax</h2>
<div class="outline-text-2" id="text-org9cd7ff4">
</div>
<div id="outline-container-orge8b7f13" class="outline-3">
<h3 id="orge8b7f13">Funções, tuplas e pattern matching</h3>
<div class="outline-text-3" id="text-orge8b7f13">
<p>
A maioria dos métodos de F# que fazem wrapping na API da .NET
não são funções com múltiplos argumentos, mas sim tuplas. Isso
pode ser confuso no começo, mas é assim que funciona no ecossistema
de F#. O tipo <code>int * int</code> denota uma tupla de inteiros (int, int).
Enquanto na notação de tipos <code>int -&gt; int</code> é uma função curry que recebe
uma parâmetro int e retorna int.
</p>


<div class="org-src-container">
<pre class="src src-fsharp"><span style="color: #51afef;">open</span> <span style="color: #FCCE7B;">System.Net</span>

<span style="color: #62686E;">// </span><span style="color: #62686E;">usando tuplas como argumento (url, file) e definindo uma fun&#231;&#227;o curry</span>
<span style="color: #62686E;">// </span><span style="color: #62686E;">do tipo: string -&gt; string -&gt; unit</span>
<span style="color: #51afef;">let</span> <span style="color: #5cEfFF;">download</span> (<span style="color: #DFDFDF;">url</span>:<span style="color: #FCCE7B;">string</span>) (<span style="color: #DFDFDF;">file</span>:<span style="color: #FCCE7B;">string</span>) = <span style="color: #51afef;">new</span> WebClient().DownloadFile(url, file<span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">)</span>

download <span style="color: #7bc275;">"www.google.com"</span> <span style="color: #7bc275;">"google.html"</span> <span style="color: #62686E;">// </span><span style="color: #62686E;">faz download de um arquivo</span>

</pre>
</div>

<p>
Curried functions são muito úteis por causa da possibilidade de fazer
partial application. Onde você passa apenas alguns dos primeiros parâmetros
e então uma nova função é definida. Um exemplo simples é dado a seguir:
</p>

<div class="org-src-container">
<pre class="src src-fsharp"><span style="color: #51afef;">open</span> <span style="color: #FCCE7B;">System</span>

<span style="color: #C57BDB; font-weight: bold;">[&lt;EntryPoint&gt;]</span>
<span style="color: #51afef;">let</span> <span style="color: #5cEfFF;">main</span> <span style="color: #DFDFDF;">argv</span> =
  <span style="color: #51afef;">let</span> <span style="color: #DFDFDF;">print</span> = printfn <span style="color: #7bc275;">"%d"</span> <span style="color: #62686E;">// </span><span style="color: #62686E;">canonical print</span>
  [1..10] <span style="color: #87cefa;">|&gt;</span> List.map print <span style="color: #87cefa;">|&gt;</span> ignore

</pre>
</div>
</div>
</div>

<div id="outline-container-org87a02be" class="outline-3">
<h3 id="org87a02be">Funções recursivas</h3>
<div class="outline-text-3" id="text-org87a02be">
<p>
Uma função recursiva recebe a keyword <code>rec</code> antes da definição.
</p>

<div class="org-src-container">
<pre class="src src-fsharp"><span style="color: #51afef;">let</span> <span style="color: #51afef;">rec</span> <span style="color: #5cEfFF;">fat</span> <span style="color: #DFDFDF;">n</span> =
    <span style="color: #51afef;">match</span> n <span style="color: #51afef;">with</span>
    <span style="color: #87cefa;">|</span> 1 <span style="color: #87cefa;">|</span> 0 -&gt; 1
    <span style="color: #87cefa;">|</span> _ -&gt; n * fat (n - 1)
</pre>
</div>

<p>
A precisão de entrada e saída, por padrão é Int32.
</p>
</div>
</div>

<div id="outline-container-org49ede0d" class="outline-3">
<h3 id="org49ede0d">Sequências, Listas e Arrays</h3>
<div class="outline-text-3" id="text-org49ede0d">
<p>
Em F# há três tipos de coleções usadas:
</p>

<ul class="org-ul">
<li>Seq</li>
<li>List</li>
<li>Array</li>
</ul>

<p>
List e Array possuem a diferença em que Arrays possuem tamanho
fixo, mas acesso constante. Listas possuem tamanhos arbitrários, mas por outro lado
o acesso é O(n).
</p>

<p>
Sequências são definidas como lazy lists, onde os elementos são avaliados
de forma preguiçosa. Um bom exemplo é um algoritmo para cálculo de números
primos de forma assíncrona:
</p>

<div class="org-src-container">
<pre class="src src-fsharp"><span style="color: #62686E;">/// </span><span style="color: #62686E;">A simple prime number detector</span>
<span style="color: #51afef;">let</span> <span style="color: #5cEfFF;">isPrime</span> (<span style="color: #DFDFDF;">n</span>:<span style="color: #FCCE7B;">int</span>) =
   <span style="color: #51afef;">let</span> <span style="color: #DFDFDF;">bound</span> = int (sqrt (float n))
   seq {2 .. bound} <span style="color: #87cefa;">|&gt;</span> Seq.forall (<span style="color: #51afef;">fun</span> <span style="color: #DFDFDF;">x</span> -&gt; n % x &lt;&gt; 0)

<span style="color: #62686E;">// </span><span style="color: #62686E;">We are using async workflows</span>
<span style="color: #51afef;">let</span> <span style="color: #5cEfFF;">primeAsync</span> <span style="color: #DFDFDF;">n</span> =
    <span style="color: #51afef;">async</span> { <span style="color: #51afef;">return</span> (n, isPrime n) }

<span style="color: #62686E;">/// </span><span style="color: #62686E;">Return primes between m and n using multiple threads</span>
<span style="color: #51afef;">let</span> <span style="color: #5cEfFF;">primes</span> <span style="color: #DFDFDF;">m</span> <span style="color: #DFDFDF;">n</span> =
    seq {m .. n}
        <span style="color: #87cefa;">|&gt;</span> Seq.map primeAsync
        <span style="color: #87cefa;">|&gt;</span> Async.Parallel
        <span style="color: #87cefa;">|&gt;</span> Async.RunSynchronously
        <span style="color: #87cefa;">|&gt;</span> Array.filter snd
        <span style="color: #87cefa;">|&gt;</span> Array.map fst

<span style="color: #62686E;">// </span><span style="color: #62686E;">Run a test</span>
primes 1000000 1002000
    <span style="color: #87cefa;">|&gt;</span> Array.iter (printfn <span style="color: #7bc275;">"%d"</span>)
</pre>
</div>
</div>
</div>
</div>
