org/programming/fsharp.org
** Web Development

- Giraffe é um webframework funcional para F#
- Fable é usado para fazer transpiler de JS

Ou seja, Giraffe é recomendado para fazer backend em F#
e Fable frontend.

** API .NET Core

Algumas coisas úteis que encontrei na API do .NET core:

- ~System.IO.GetTempPath~ retorna ~/tmp~

* Tooling
** Forge

Quem está me salvando ultimamente para criação de projetos na linha de comando
é o ~Forge~. Um sistema de gerenciamento de projetos/soluções criado para
atuar em conjunto com o FAKE(build system de F#) e Paket, o gerenciador
de dependências.

Em geral você cria uma solução, então cria um projeto anexado a essa solução.
Quero ainda ver se é possível criar um projeto sem precisar criar uma solução,
mas não tenho certeza ainda se é possível.

*** Forge add reference não funciona com o Nuget

Algo que me deixou um pouco confuso foi o comando ~forge add reference~ que
só pode ser usado para referências locais, como ~System.Drawing~.
Se for uma dependência externa, geralmente gerenciada pelo paket, deve ser adicionada
da seguinte maneira: forge paket ~add -i Nuget Some.Dependency~

Não há pretensão de isso ser incluido como uma feature por quebra de design, já
que é algo que o paket faz. Esta [[https://github.com/fsharp-editing/Forge/issues/33][issue]] descreve exatamente este problema.


*** Adicionar um asset não compilável para fsproj

É necessário adicionar uma entrada semelhante a essa ao .fsproj

#+BEGIN_SRC xml
  <Content Include="Template.json">
      <CopyToOutputDirectory>PreserveNewest</CopyToOutputDirectory>
  </Content>
#+END_SRC

Fiz uma issue perguntando se é possível fazer isso diretamente usar o forge.
Resta esperar uma resposta.

EDIT: <2017-08-09 Wed 11:20>
Ainda não é possível fazer isso. [[https://github.com/fsharp-editing/Forge/issues/75]]
Embora seja possível fazer algo semelhante com a flag:
~--build-action Content~ na qual a tag criada será <Content> invés de <Compile>.
Mas ainda não adicionará a tag <CopyToOutputDirectory> para copiar na compilação.
De toda maneira, vou ter que editar esses arquivos nojentos de projeto da Microsoft.
** Dotnet Self-Contained Apps

Então, environment .NET Core é simplesmente infernal, como fazer
com que o seu /target host/ não sofra o mesmo? Microsoft pensou nisso
considerando a dor descomunal que é ter uma instalação do .NET. Então
provê um meio de disponibilizar aplicações que contém o próprio
runtime.

Para exemplo desse tópico estarei criando um aplicação hello-world de
exemplo baseado no template console pra F#. Estou assumindo aqui que
esteja sendo usado .NET Core SDK 2.0 e o runtime também. Legacy is
dead.

#+BEGIN_SRC sh
dotnet new console -lang 'f#' -n test
#+END_SRC

Isto irá cria uma nova aplicação já pronta em ~test/~ com o seguinte
arquivo ~Program.fs~:

#+NAME: procedimento:hello-world
#+BEGIN_SRC fsharp
  open System

  [<entryPoint>]
  let main argv =
      printfn "Hello World, F#!"
      0 // return an integer exit code
#+END_SRC

Isso funciona até bem, mas infelizmente eu tenho alguns problemas que
realmente me incomoda um bucado. Um desses problemas envolve a uma
certa necessidade de instalar dependências na máquina host. As que
precisei instalar explicitamente pra funcionar foram no Ubuntu Xenial
(16.04) ~libicu-dev~ e ~libunwind8~. É importante também lembrar que
o aplicativo publicado fica em ~/<conf>/<runtime/publish~. Isso embora
pareça óbvio, eu me confundi inicialmente pq é compilado também na
raíz do runtime outra versão que não sei nem pq existe lá...

Mas então, voltando aos passos, foi necessário os seguintes:

#+NAME: procedimento:host-dependencies
#+CAPTION: Dependências necessárias para executar o self-contained app
#+BEGIN_SRC sh
sudo apt install libunwind8 libicu-dev
#+END_SRC


Sendo que o procedimento de rele

#+BEGIN_SRC sh
dotnet publish -c Release -r ubuntu.16.04-x64 --self-contained
#+END_SRC

A flag ~--self-contained~ parece fazer pouco sentido no começo, tendo
em vista que ~publish~ deveria já fazer isso de toda maneira, mas no
entanto não é o comportamento padrão. Se eu não passar essa flag, a
aplicação será apenas free-framework e dependências, mas ainda
precisará do runtime do .NET Core.


Eu ainda não achei uma forma de listar os runtimes disponíveis pela
linha de comando e se quer achei também uma documentação clara sobre
isso.

O que me incomoda ainda é o fato de eu ainda ter que instalar algumas
coisas no host para a /self-contained application/ funcionar como é o
esperado. Se é /self-contained/ porque eu tenho que instalar alguma
coisa a mais no host? Isso é muito chato...


Uma compilação /self-contained/ não é nada leve. É cerca de *70MB* puro
e uns *24MB* com ~.tar.gz~, algoritmo de compactação ~gzip~.
Por que tanto sofrimento?

Referências de problemas:

- [[https://github.com/dotnet/cli/issues/3390][Self-contained applications in Linux does not work]]
- [[https://github.com/dotnet/core/blob/master/Documentation/self-contained-linux-apps.md][Self-contained Linux applications]]
- [[https://github.com/dotnet/core/blob/master/Documentation/build-and-install-rhel6-prerequisites.md][How to use .NET Core on RHEL 6 / CentOS 6]] (fala sobre embarcar third-libraries)
