_posts/2017-08-20-fsharp.html

<div id="outline-container-orgf6a6241" class="outline-2">
<h2 id="orgf6a6241">Ecosystem</h2>
<div class="outline-text-2" id="text-orgf6a6241">
</div>
<div id="outline-container-org8ed81e4" class="outline-3">
<h3 id="org8ed81e4">Web Development</h3>
<div class="outline-text-3" id="text-org8ed81e4">
<ul class="org-ul">
<li>Giraffe é um webframework funcional para F#</li>
<li>Fable é usado para fazer transpiler de JS</li>
</ul>

<p>
Ou seja, Giraffe é recomendado para fazer backend em F#
e Fable frontend.
</p>
</div>
</div>

<div id="outline-container-org332232f" class="outline-3">
<h3 id="org332232f">API .NET Core</h3>
<div class="outline-text-3" id="text-org332232f">
<p>
Algumas coisas úteis que encontrei na API do .NET core:
</p>

<ul class="org-ul">
<li><code>System.IO.GetTempPath</code> retorna <code>/tmp</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org37b1048" class="outline-2">
<h2 id="org37b1048">Tooling</h2>
<div class="outline-text-2" id="text-org37b1048">
</div>
<div id="outline-container-orgd055089" class="outline-3">
<h3 id="orgd055089">Forge</h3>
<div class="outline-text-3" id="text-orgd055089">
<p>
Quem está me salvando ultimamente para criação de projetos na linha de comando
é o <code>Forge</code>. Um sistema de gerenciamento de projetos/soluções criado para
atuar em conjunto com o FAKE(build system de F#) e Paket, o gerenciador
de dependências.
</p>

<p>
Em geral você cria uma solução, então cria um projeto anexado a essa solução.
Quero ainda ver se é possível criar um projeto sem precisar criar uma solução,
mas não tenho certeza ainda se é possível.
</p>
</div>

<div id="outline-container-orgea9467b" class="outline-4">
<h4 id="orgea9467b">Forge add reference não funciona com o Nuget</h4>
<div class="outline-text-4" id="text-orgea9467b">
<p>
Algo que me deixou um pouco confuso foi o comando <code>forge add reference</code> que
só pode ser usado para referências locais, como <code>System.Drawing</code>.
Se for uma dependência externa, geralmente gerenciada pelo paket, deve ser adicionada
da seguinte maneira: forge paket <code>add -i Nuget Some.Dependency</code>
</p>

<p>
Não há pretensão de isso ser incluido como uma feature por quebra de design, já
que é algo que o paket faz. Esta <a href="https://github.com/fsharp-editing/Forge/issues/33">issue</a> descreve exatamente este problema.
</p>
</div>
</div>


<div id="outline-container-orgcaa4967" class="outline-4">
<h4 id="orgcaa4967">Adicionar um asset não compilável para fsproj</h4>
<div class="outline-text-4" id="text-orgcaa4967">
<p>
É necessário adicionar uma entrada semelhante a essa ao .fsproj
</p>

<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #5cEfFF;">Content</span> <span style="color: #DFDFDF;">Include</span>=<span style="color: #7bc275;">"Template.json"</span>&gt;
    &lt;<span style="color: #5cEfFF;">CopyToOutputDirectory</span>&gt;PreserveNewest&lt;/<span style="color: #5cEfFF;">CopyToOutputDirectory</span>&gt;
&lt;/<span style="color: #5cEfFF;">Content</span>&gt;
</pre>
</div>

<p>
Fiz uma issue perguntando se é possível fazer isso diretamente usar o forge.
Resta esperar uma resposta.
</p>

<p>
EDIT: <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-08-09 Wed 11:20&gt;</span></span>
Ainda não é possível fazer isso. <a href="https://github.com/fsharp-editing/Forge/issues/75">https://github.com/fsharp-editing/Forge/issues/75</a>
Embora seja possível fazer algo semelhante com a flag:
<code>--build-action Content</code> na qual a tag criada será &lt;Content&gt; invés de &lt;Compile&gt;.
Mas ainda não adicionará a tag &lt;CopyToOutputDirectory&gt; para copiar na compilação.
De toda maneira, vou ter que editar esses arquivos nojentos de projeto da Microsoft.
</p>
</div>
</div>
</div>
<div id="outline-container-org5c063d5" class="outline-3">
<h3 id="org5c063d5">Dotnet Self-Contained Apps</h3>
<div class="outline-text-3" id="text-org5c063d5">
<p>
Então, environment .NET Core é simplesmente infernal, como fazer
com que o seu <i>target host</i> não sofra o mesmo? Microsoft pensou nisso
considerando a dor descomunal que é ter uma instalação do .NET. Então
provê um meio de disponibilizar aplicações que contém o próprio
runtime.
</p>

<p>
Para exemplo desse tópico estarei criando um aplicação hello-world de
exemplo baseado no template console pra F#. Estou assumindo aqui que
esteja sendo usado .NET Core SDK 2.0 e o runtime também. Legacy is
dead.
</p>

<div class="org-src-container">
<pre class="src src-sh">dotnet new console -lang <span style="color: #7bc275;">'f#'</span> -n test
</pre>
</div>

<p>
Isto irá cria uma nova aplicação já pronta em <code>test/</code> com o seguinte
arquivo <code>Program.fs</code>:
</p>

<div class="org-src-container">
<pre class="src src-fsharp" id="org2740a65"><span style="color: #51afef;">open</span> <span style="color: #FCCE7B;">System</span>

<span style="color: #C57BDB; font-weight: bold;">[&lt;entryPoint&gt;]</span>
<span style="color: #51afef;">let</span> <span style="color: #5cEfFF;">main</span> <span style="color: #DFDFDF;">argv</span> =
    printfn <span style="color: #7bc275;">"Hello World, F#!"</span>
    0 <span style="color: #62686E;">// </span><span style="color: #62686E;">return an integer exit code</span>
</pre>
</div>

<p>
Isso funciona até bem, mas infelizmente eu tenho alguns problemas que
realmente me incomoda um bucado. Um desses problemas envolve a uma
certa necessidade de instalar dependências na máquina host. As que
precisei instalar explicitamente pra funcionar foram no Ubuntu Xenial
(16.04) <code>libicu-dev</code> e <code>libunwind8</code>. É importante também lembrar que
o aplicativo publicado fica em <code>/&lt;conf&gt;/&lt;runtime/publish</code>. Isso embora
pareça óbvio, eu me confundi inicialmente pq é compilado também na
raíz do runtime outra versão que não sei nem pq existe lá&#x2026;
</p>

<p>
Mas então, voltando aos passos, foi necessário os seguintes:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Dependências necessárias para executar o self-contained app</label><pre class="src src-sh" id="org16e1003">sudo apt install libunwind8 libicu-dev
</pre>
</div>


<p>
Sendo que o procedimento de rele
</p>

<div class="org-src-container">
<pre class="src src-sh">dotnet publish -c Release -r ubuntu.16.04-x64 --self-contained
</pre>
</div>

<p>
A flag <code>--self-contained</code> parece fazer pouco sentido no começo, tendo
em vista que <code>publish</code> deveria já fazer isso de toda maneira, mas no
entanto não é o comportamento padrão. Se eu não passar essa flag, a
aplicação será apenas free-framework e dependências, mas ainda
precisará do runtime do .NET Core.
</p>


<p>
Eu ainda não achei uma forma de listar os runtimes disponíveis pela
linha de comando e se quer achei também uma documentação clara sobre
isso.
</p>

<p>
O que me incomoda ainda é o fato de eu ainda ter que instalar algumas
coisas no host para a <i>self-contained application</i> funcionar como é o
esperado. Se é <i>self-contained</i> porque eu tenho que instalar alguma
coisa a mais no host? Isso é muito chato&#x2026;
</p>


<p>
Uma compilação <i>self-contained</i> não é nada leve. É cerca de <b>70MB</b> puro
e uns <b>24MB</b> com <code>.tar.gz</code>, algoritmo de compactação <code>gzip</code>.
Por que tanto sofrimento?
</p>

<p>
Referências de problemas:
</p>

<ul class="org-ul">
<li><a href="https://github.com/dotnet/cli/issues/3390">Self-contained applications in Linux does not work</a></li>
<li><a href="https://github.com/dotnet/core/blob/master/Documentation/self-contained-linux-apps.md">Self-contained Linux applications</a></li>
<li><a href="https://github.com/dotnet/core/blob/master/Documentation/build-and-install-rhel6-prerequisites.md">How to use .NET Core on RHEL 6 / CentOS 6</a> (fala sobre embarcar third-libraries)</li>
</ul>
</div>
</div>
</div>
